In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.Series(np.random.randn(9),
index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
[1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.605079
   2   -1.030466
   3   -0.197045
b  1    0.947541
   3    0.233930
c  1   -1.146312
   2   -0.185010
d  2    0.966741
   3    1.614562
dtype: float64

In [5]:
data[['b','c']]

b  1    0.947541
   3    0.233930
c  1   -1.146312
   2   -0.185010
dtype: float64

In [6]:
data.loc['d']

2    0.966741
3    1.614562
dtype: float64

In [7]:
data.loc[: , 2]

a   -1.030466
c   -0.185010
d    0.966741
dtype: float64

In [8]:
data.unstack()

          1         2         3
a  0.605079 -1.030466 -0.197045
b  0.947541       NaN  0.233930
c -1.146312 -0.185010       NaN
d       NaN  0.966741  1.614562

In [9]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
 columns=[['Ohio', 'Ohio', 'Colorado'],
 ['Green', 'Red', 'Green']])

In [10]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11